{ 
  "moreInfo" : "More info",  
  "welcome.title": "Follow our recommendations to select <breakLine /> the right amount of GLM tokens",
  "welcome.description" : [
    "Different tasks require varying amounts of computational resources. By choosing the right amount of <golemIcon/> GLM tokens, you match your token balance to the specific needs of your project.",
    "To purchase GLM tokens for computing power, you’ll also need to cover the blockchain transaction costs. GLM tokens are specific for computing services, and a different token is needed for transaction fees. This is why we include a small amount of <maticIcon /> MATIC tokens in our suggestions." ,
    "When buying tokens, you'll initially acquire MATIC, then convert it to GLM. The specified amount of $ ensures you get enough of both MATIC and GLM for the computing power you need.", 
    "Not sure yet? Don't worry, this isn't your final decision.The actual purchase of tokens comes in the next steps." 
  ],
  "welcome.explainGLM.title" : "<golemIcon />  <tab/> What is GLM token?",
  "welcome.explainGLM.content" : "GLM is a utility token available on both Polygon and Ethereum  blockchains. GLM is used as a currency in peer-to-peer transactions for renting computing power on Golem Network. <emptyLine/> In other words, You use GLM tokens to pay for computation power on Golem Network.",
  "welcome.explainMATIC.title" : "<maticIcon />  <tab/> Why do I need to get MATIC token?",  
  "welcome.explainMATIC.content" : "MATIC is a native token of Polygon blockchain, which we recommend as a default blockchain to settle Golem payments. <emptyLine />  need MATIC to be able to cover Polygon transaction fees and as a result to be able to send GLM payments.,",
  "welcome.explainFees.title" : "What are the transaction fees?",
  "welcome.explainFees.content" : "Each transaction on Polygon blockchain has to be confirmed by validator to be considered as settled. Validators are compensated for their hard work with transaction fees. Consequently, each transaction on Polygon blockchain is associated with some fee value. As a general rule, fees fluctuate with time, rising when network is 'busy' and falling down when it is not.",
  "welcome.explainOffRamp.title" : "Can I revert my tokens back to traditional currencies?",
  "welcome.explainOffRamp.content" : "Yes. There are multiple ways to do that. However, we recommend the following one: <breakLine/> - As a first step swap your remaining GLM tokens into MATIC via Uniswap <breakLine /> - Sell all your MATIC for traditional currency of your choice via RAMP <emptyLine /> Please keep in mind that buying as well as selling cryptocurrencies might result with taxable event based on your jurisdiction.",
  "connect-wallet.title" : "Digital wallet is needed to manage your GLM tokens",
  "connect-wallet.description" : [
    "Wallet is a digital tool that allows you to store,send, and receive cryptocurrency tokens.",
    "To begin using Golem tools, you need tokens such as GLM for computing power and MATIC for blockchain transaction fees. Wallet is needed to store and manage these tokens.", 
    "We recommend only trusted wallets that have millions of users worldwide such as <breakLine /><metamaskIcon /> MetaMask, and <breakLine/> <trustIcon /> TrustWallet "
  ],
  "connect-wallet.explainMetamask.title" : "<metamaskIcon /> <tab/> What is MetaMask?",
  "connect-wallet.explainMetamask.content" : "MetaMask is one the oldest and well known digital wallets for cryptocurrencies. It supports EVM based blockchains such as Polygon and Ethereum. It is available as a browser extension (Chrome, Firefox, Brave, Edge, Opera) or mobile app (iOS and Android).You can learn more on their website: https://metamask.io/",
  "connect-wallet.explainTrustWallet.title" : "<trustIcon /> <tab /> What is TrustWallet?",
  "connect-wallet.explainTrustWallet.content" : "TrustWallet is a digital wallet that allows you to store, send, and receive cryptocurrency tokens. It is available as a mobile app. <emptyLine /> TrustWallet is one of the most popular wallets in the world, with over 5 million users. It is also one of the most trusted wallets, with a 4.7 rating on the App Store and a 4.6 rating on the Google Play Store.",
  "connect-wallet.explainChoose.title" : "How do I choose a right wallet?",
  "connect-wallet.explainChoose.content" : "Both Metamask and TrustWallet are well established and widely used tools. They have similar interface and capabilities. As a result there is no much difference if you choose one or another. Just be sure that chosen wallet supports your browser (TrustWallet is not available on Firefox ).",



  "chooseNetwork.title" : "Blockchain network is what makescrypto transactions possible",
  "chooseNetwork.description" : [
    "Think of it as choosing a mobile network for your phone. Just as you need a network to make calls or send messages, you need a blockchain network to send, receive or store your GLM tokens. Different networks have different features.",
    "We recommend <maticIcon/> Polygon because the transactions are faster and cheaper compared to Ethereum network. .",
    "The main distinction for Golem users is that <ethereumIcon /> Ethereum, being one of the oldest blockchain networks, experiences high usage, which leads to higher fees and slower network performance."
  ],
  "chooseNetwork.explainEthereum.title" : "<ethereumIcon /> <tab/> What is Ethereum?",
  "chooseNetwork.explainEthereum.content" : "Ethereum is a blockchain network that allows developers to build decentralized applications. It is the most popular blockchain for smart contracts. <emptyLine /> Ethereum is the native blockchain of GLM token. However, it is not the only blockchain that can be used to settle payments on Golem Network.",
  "chooseNetwork.explainPolygon.title" : "<maticIcon /> <tab/> What is Polygon?",
  "chooseNetwork.explainPolygon.content" : "Polygon is a blockchain network that allows developers to build decentralized applications. It is the most popular blockchain for smart contracts. <emptyLine /> Polygon is the native blockchain of MATIC token. However, it is not the only blockchain that can be used to settle payments on Golem Network.",
  "chooseNetwork.explainCost.title" : "How do I choose a right blockchain?",
  "chooseNetwork.explainCost.content" : "Both Ethereum and Polygon are well established and widely used blockchains. They have similar interface and capabilities. As a result there is no much difference if you choose one or another. Just be sure that chosen blockchain is supported by your wallet (Polygon is not supported by TrustWallet).",




  "matic.description" : ["MATIC tokens are used to cover transaction fees on Polygon, our preferred blockchain network.<emptyLine />When buying GLM and MATIC tokens, you'll first purchase MATIC, then convert some of them into GLM. With the specified amount of $, you can obtain enough MATIC and GLM to utilize the desired computing power.<emptyLine /> Don't worry about the specifics just yet; we're here to guide you through each step.,"],


  "onRamp.title" : "MATIC tokens will cover the transaction costs when you are acquiring GLM tokens",
  "onRamp.description" : [
    "Transaction fees compensate the network for the work required to process and validate transactions.", 
    "When you acquire GLM tokens on the<maticIcon/> Polygon network, you need to pay the transaction fees in <maticCoinIcon /> MATIC, because it's the native currency of Polygon blockchain.It's like having the right currency to pay for a service in a specific country.",
    "This is a standard practice in many blockchain networks, where you pay for transactions in the network's native currency."
  ], 
  "onRamp.explainMatic.title" : "<maticCoinIcon/> What is MATIC token?",
  "onRamp.explainMatic.content" : "MATIC is a native token of Polygon blockchain just like ETH is a native token of Ethereum blockchain.",
  "onRamp.whyMatic.title" : "Why do I need to get MATIC?",
  "onRamp.whyMatic.content" : "MATIC is used to cover transaction fees on Polygon blockchain. Without it it would be impossible to send a transaction.",
  "onRamp.explainTransaction.title" : "How the transaction is made?",
  "onRamp.explainTransaction.content" : "Transaction is a digital message, which states what are you want to do on the blockchain. For instance You can send your funds to another wallet or maybe interact with some decentralized application. <emptyLine /> Each transaction has to be signed with a private key stored in the wallet. As a result only owner of the wallet can use funds stored on it. The whole process is governed by the digital wallet such as Metamask.",
  "onRamp.explainNative.title" : "What is native token?",
  "onRamp.explainNative.content" : "Each transaction has to be signed with a private key stored in the wallet. As a result only owner of the wallet can use funds stored on it. The whole process is governed by the digital wallet such as Metamask.",


  "swap.title" : "GLM tokens are essential to pay for Golem services ",
  "swap.description" : [
    "To acquire GLM tokens, just convert some of your freshly obtained MATIC tokens.",
    "As MATIC, the native currency of Polygon, is used to cover transaction fees (including the costs of converting MATIC to GLM), it's important not to convert all your MATIC.",
    "That’s why you should always keep a small amount of MATIC to handle these costs. "
  ],
  "swap.explainGLMAmount.title" : "How I can calculate how much GLM tokens do I need?", 
  "swap.explainGLMAmount.content" : "Golem Network is a living ecosystem where market forces can move prices up and down. That is why We can only provide you educated recommendations. However, you can try to assess amount of needed GLM by checking  <a className='contents text-primary underline' href='https://stats.golem.network/' target='_blank'> Golem Network Stats: </a>",
  "swap.explainRecommendation.title" : "How the recommendations are calculated?",
  "swap.explainRecommendation.content" : "Recommendations are calculated based on our internal experiences with Golem Network. As a rule of thumb we recommend to swap around 80% of your MATIC into GLM.",

  "transfer.title" : "Yagna is a Golem Client, which has an internal wallet enabling payments on the Golem Network", 
  "transfer.description" : [
    "Internal Yagna wallet allows requestors to pay for services within the Golem ecosystem and enables providers to receive payments.",
    "While transferring funds to Yagna might seem like an additional step compared to using external wallets like MetaMask, this process guarantees that <b>all transactions  are automatic, efficient, and fully compatible with the Golem network's ecosystem</b>"
  ]

}

